Repository: louisdrouhin/EasySave
Catalog: EasySave.Core/Ressources/Strings.*.resx
Languages: fr

# Menu_Title
source: EASYSAVE - BACKUP MANAGEMENT
fr: EASYSAVE - GESTION DES SAUVEGARDES

# Menu_CreateJob
source: Create a backup job
fr: Créer un travail de sauvegarde

# Menu_ExecuteJobs
source: Execute backup(s)
fr: Exécuter une/des sauvegarde

# Menu_DeleteJob
source: Delete a job
fr: Supprimer un travail

# Menu_ShowJobs
source: Show all jobs
fr: Afficher tous les travaux

# Menu_ChangeLanguage
source: Change language
fr: Changer de langue

# Menu_Quit
source: Quit application
fr: Quitter l'application

# CreateJob_Title
source: === CREATE A BACKUP JOB ===
fr: === CRÉER UN TRAVAIL DE SAUVEGARDE ===

# CreateJob_ExistingJobs
source: Existing jobs:
fr: Jobs existants :

# CreateJob_NoExistingJobs
source: No existing jobs.
fr: Aucun job existant.

# CreateJob_JobName
source: Job name:
fr: Nom du travail :

# CreateJob_SourcePath
source: Source path:
fr: Chemin source :

# CreateJob_DestinationPath
source: Destination path:
fr: Chemin de destination :

# CreateJob_BackupType
source: Backup type (1=Full, 2=Differential):
fr: Type de sauvegarde (1=Complète, 2=Différentielle) :

# CreateJob_Success
source: Job '{0}' created successfully!
fr: Travail '{0}' créé avec succès!

# BackupType_Full
source: Full
fr: Complète

# BackupType_Differential
source: Differential
fr: Différentielle

# ExecuteJob_Title
source: === EXECUTE A JOB ===
fr: === EXÉCUTER UN TRAVAIL ===

# ExecuteJob_Identifier
source: Job number:
fr: Nom ou numéro du travail :

# ExecuteJob_InProgress
source: Executing job '{0}'...
fr: Exécution du travail '{0}' en cours...

# ExecuteJob_Success
source: Backup completed successfully!
fr: Sauvegarde terminée avec succès!

# ExecuteAllJobs_Title
source: === EXECUTE ALL JOBS ===
fr: === EXÉCUTER TOUS LES TRAVAUX ===

# ExecuteAllJobs_InProgress
source: Executing all jobs...
fr: Exécution de tous les travaux en cours...

# ExecuteAllJobs_Success
source: All backups completed!
fr: Toutes les sauvegardes sont terminées!

# ExecuteJobs_Title
source: === EXECUTE JOBS ===
fr: === EXÉCUTER DES TRAVAUX ===

# ExecuteJobs_AvailableJobs
source: Available jobs:
fr: Jobs disponibles :

# ExecuteJobs_SelectPrompt
source: Enter the job number(s) to execute (comma-separated) or 'all' for all:
fr: Entrez le(s) numéro(s) des jobs à exécuter (séparés par des virgules) ou 'all' pour tous :

# ExecuteJobs_Executing
source: Executing {0} job(s)...
fr: Exécution de {0} job(s)...

# ExecuteJobs_ExecutingJob
source: Executing job: {0}...
fr: Exécution du job : {0}...

# ExecuteJobs_NoSelection
source: No job selected.
fr: Aucun job sélectionné.

# ExecuteJobs_InvalidNumber
source: Invalid number: {0}
fr: Numéro invalide : {0}

# ExecuteJobs_NoJobs
source: No jobs configured yet.
fr: Aucun travail configuré pour le moment.

# ExecuteJobs_Instructions
source: Use 'Create a backup job' option to get started.
fr: Utilisez l'option 'Créer un travail' pour commencer.

# ExecuteJobs_Success
source: Job '{0}' executed successfully!
fr: Job '{0}' exécuté avec succès!

# ExecuteJobs_Error
source: Error executing job '{0}': {1}
fr: Erreur lors de l'exécution du job '{0}' : {1}

# DeleteJob_Title
source: === DELETE A JOB ===
fr: === SUPPRIMER UN TRAVAIL ===

# DeleteJob_ExistingJobs
source: Existing jobs:
fr: Jobs existants :

# DeleteJob_NoJobsToDelete
source: No jobs to delete.
fr: Aucun job à supprimer.

# DeleteJob_JobName
source: Job number to delete:
fr: Nom du travail à supprimer :

# DeleteJob_Success
source: Job '{0}' deleted successfully!
fr: Travail '{0}' supprimé avec succès!

# ShowJobs_Title
source: === BACKUP JOBS LIST ===
fr: === LISTE DES TRAVAUX DE SAUVEGARDE ===

# ShowJobs_NoJobs
source: No jobs configured yet.
fr: Aucun travail configuré pour le moment.

# ShowJobs_Example
source: Expected output example:
fr: Exemple de sortie attendue:

# ShowState_Title
source: === BACKUP STATUS ===
fr: === ÉTAT DES SAUVEGARDES ===

# ShowState_NoBackup
source: No backup in progress.
fr: Aucune sauvegarde en cours.

# Common_PressKey
source: Press any key to return to menu...
fr: Appuyez sur n'importe quelle touche pour revenir au menu...

# Common_Closing
source: Closing EasySave...
fr: Fermeture d'EasySave...

# General_PressKeyToContinue
source: Press any key to return to menu...
fr: Appuyez sur une touche pour revenir au menu...

# General_Closing
source: Closing EasySave...
fr: Fermeture d'EasySave...

# Language_SelectLanguage
source: Select a language / Sélectionnez une langue:
fr: Sélectionnez une langue / Select a language:

# Language_Changed
source: Language changed to '{0}' successfully!
fr: Langue changée avec succès!

# Error_ConfigFileNotFound
source: Unable to start: the base configuration file cannot be found.
fr: Impossible de démarrer : le fichier de configuration de base est introuvable.

# BusinessCheck_ApplicationRunning
source: The application '{0}' is running. Unable to execute the backup job.
fr: L'application '{0}' est lancée. Impossible d'exécuter le job de sauvegarde.

# Error_InvalidLogFormat
source: Invalid log format. The log format must be 'json' or 'xml'.
fr: Format de log invalide. Le format de log doit être 'json' ou 'xml'.

# Error_CultureNotFound
source: Culture '{0}' not found. Keeping current language.
fr: Culture '{0}' non trouvée. Culture actuelle conservée.

# MainWindow_Menu_Jobs
source: Jobs
fr: Travaux

# MainWindow_Menu_Logs
source: Logs
fr: Journaux

# MainWindow_Menu_Settings
source: Settings
fr: Paramètres

# MainWindow_FatalError
source: FATAL ERROR in MainWindow: {0} Stack: {1}
fr: ERREUR FATALE dans MainWindow : {0} Pile : {1}

# JobsPage_Header_Title
source: Saved Jobs
fr: Travaux enregistrés

# JobsPage_Header_Subtitle
source: Manage your backup jobs
fr: Gérer vos travaux de sauvegarde

# JobsPage_Button_NewJob
source: + New Job
fr: + Nouveau travail

# JobsPage_Error_BusinessAppTitle
source: Business Application Running
fr: Application métier en cours

# JobsPage_Error_BusinessAppMessage
source: Business application '{0}' is running. Backup job execution blocked.
fr: L'application métier '{0}' est en cours. Exécution bloquée.

# LogsPage_Title
source: Backup Logs
fr: Logs des sauvegardes

# LogsPage_Button_OpenFolder
source: Open logs folder
fr: Ouvrir le dossier de logs

# LogsPage_TotalLogs
source: Total logs:
fr: Total des logs :

# LogsPage_Error_LogFolder
source: Error opening folder: {0}
fr: Erreur lors de l'ouverture du dossier : {0}

# SettingsPage_Title
source: Settings Page
fr: Page des paramètres

# SettingsPage_Header_Title
source: Settings
fr: Paramètres

# SettingsPage_Header_Subtitle
source: Application configuration overview
fr: Vue d'ensemble de la configuration

# SettingsPage_Section_Logs_Path
source: Logs path
fr: Chemin des logs

# SettingsPage_Section_Logs_Format
source: Log format
fr: Format des logs

# SettingsPage_Section_State
source: State
fr: État

# SettingsPage_Section_State_Path
source: State file path
fr: Chemin du fichier d'état

# SettingsPage_Section_Encryption
source: Encryption
fr: Chiffrement

# SettingsPage_Section_Encryption_Extensions
source: Encrypted extensions
fr: Extensions chiffrées

# SettingsPage_Section_BusinessApps
source: Business Applications
fr: Applications métier

# SettingsPage_Section_BusinessApps_List
source: Monitored applications
fr: Applications surveillées

# SettingsPage_NoExtensions
source: No extension configured
fr: Aucune extension configurée

# SettingsPage_NoApps
source: No application configured
fr: Aucune application configurée

# SettingsPage_Section_Language
source: Language
fr: Langue

# SettingsPage_Section_Language_Current
source: Current language
fr: Langue actuelle

# SettingsPage_Section_About
source: About
fr: À propos

# CreateJobDialog_Title
source: Create New Job
fr: Créer un nouveau travail

# CreateJobDialog_JobName
source: Job Name
fr: Nom du travail

# CreateJobDialog_JobName_Placeholder
source: Enter job name
fr: Entrez le nom du travail

# CreateJobDialog_JobType
source: Job Type
fr: Type de travail

# CreateJobDialog_JobType_Full
source: Full
fr: Complète

# CreateJobDialog_JobType_Differential
source: Differential
fr: Différentielle

# CreateJobDialog_SourcePath
source: Source Path
fr: Chemin source

# CreateJobDialog_SourcePath_Placeholder
source: Enter source directory path
fr: Entrez le chemin du dossier source

# CreateJobDialog_DestPath
source: Destination Path
fr: Chemin de destination

# CreateJobDialog_DestPath_Placeholder
source: Enter destination directory path
fr: Entrez le chemin du dossier de destination

# CreateJobDialog_Button_Create
source: Create
fr: Créer

# CreateJobDialog_Button_Cancel
source: Cancel
fr: Annuler

# CreateJobDialog_SelectSource
source: Select Source Folder
fr: Sélectionner le dossier source

# CreateJobDialog_SelectDest
source: Select Destination Folder
fr: Sélectionner le dossier de destination

# CreateJobDialog_Error_FillFields
source: Please fill in all fields
fr: Veuillez remplir tous les champs

# ErrorDialog_Title
source: Error
fr: Erreur

# PasswordDialog_Title
source: Enter Encryption Password
fr: Entrez le mot de passe de chiffrement

# PasswordDialog_Label
source: Enter password for encryption (optional)
fr: Entrez le mot de passe pour le chiffrement (optionnel)

# PasswordDialog_Placeholder
source: Leave empty for no encryption
fr: Laisser vide pour sans chiffrement

# JobCard_Label_Files
source: FILES (PROCESSED / TOTAL)
fr: FICHIERS (TRAITÉS / TOTAL)

# JobCard_Label_Size
source: SIZE (PROCESSED / TOTAL)
fr: TAILLE (TRAITÉE / TOTAL)

# JobCard_Status_Inactive
source: Inactive
fr: Inactif

# JobCard_Status_Active
source: Active
fr: Actif

# JobCard_Progress_InProgress
source: IN PROGRESS
fr: EN COURS

# JobCard_Progress_Processing
source: Processing...
fr: Traitement...
